data/perf/campaign-f3deebfbab60/sweep-memcached-t24/memcached/tsan/run3/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       166807.30          ---          ---         4.52167         4.44700        11.83900        15.48700     11384.55 
Gets      1668054.62      1339.45   1666715.17         4.49372         4.41500        11.71100        15.42300     42250.81 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1834861.91      1339.45   1666715.17         4.49626         4.41500        11.71100        15.42300     53635.36 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       153927.47          ---          ---         4.75381         4.67100        11.77500        15.03900     10505.50 
Gets      1539257.75      1236.03   1538021.73         4.72134         4.63900        11.71100        14.97500     38988.47 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1693185.22      1236.03   1538021.73         4.72429         4.63900        11.71100        14.97500     49493.97 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       157903.09          ---          ---         4.68782         4.60700        11.77500        15.16700     10776.84 
Gets      1579013.52      1147.49   1577866.03         4.65726         4.57500        11.64700        15.16700     39988.18 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1736916.61      1147.49   1577866.03         4.66004         4.57500        11.71100        15.16700     50765.02